app/controllers/voters_controller.rb

  def index

    @voters = Voter.all
---
SELECT "voters".* FROM "voters"

  def create

    # this section updates the voter information after filling in the form
    voter_hash = params.delete('voter')
    i = Voter.new
    i.name_f = voter_hash['name_f']
    i.name_l = voter_hash['name_l']
    i.address = voter_hash['address']
    i.city = voter_hash['city']
    i.state = voter_hash['state']
    i.zip = voter_hash['zip']
    i.user = current_user
    i.election = params['election_id']
    i.save!
---
INSERT INTO "voters" ("name_f", "name_l", "address", "city", "state", "zip", "devise_id", "election", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    id = params[:id]
    @voter = Voter.find(id)
---
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = $1 LIMIT 1  [["id", 18]]

  def show

    id = Voter.where(devise_id: current_user.id).ids[0]
    @voter = Voter.find(id)
    i = @voter
    elected = ElectedThrough.where(voter_id: id)
---
SELECT "voters"."id" FROM "voters" WHERE "voters"."devise_id" = $1  [["devise_id", 5]]
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = $1 LIMIT 1  [["id", 33]]
SELECT "elected_throughs".* FROM "elected_throughs" WHERE "elected_throughs"."voter_id" = $1  [["voter_id", 39]]